// Ввод текста в графическое окно приложения.
// В верхней панели (JPanel) окна "Характеристики шрифта" определены следующие компоненты:
// надпись (JLabel) "Цвет:", раскрывающееся меню  (JComboBox),
// в котором четыре пункта: "Черный" (цвет по умолчанию),  "Красный", "Зеленый" и "Синий",
// надпись (JLabel) "Размер:" и три радиокнопки (JRadioButton) с надписями:
// "12pt" (размер по умолчанию),  "14pt" и "16pt".
// В нижней текстовой панели (JTextPane) "Ввод текста" окна приложения вводится текст, набираемый на клавиатуре.
// При выборе одного из пунктов меню текст в панели выводится соответствующим цветом и/или соответствующего размера.


public class Task13 {
    public static void main(String[] args) {
        new FontCharacteristic();

    }
}
